README.md
- [Preface](#sec-1)
  - [Keyword Conventions](#sec-1-1)
  - [Typographic Conventions](#sec-1-2)
- [Overview](#sec-2)
  - [Defining A Payment Process](#sec-2-1)
    - [PrePay Ticket](#sec-2-1-1)
- [Payment Strategies](#sec-3)
  - [Strategy Requirements](#sec-3-1)
  - [Initializing a Strategy (Using Ping++ As Example)](#sec-3-2)
- [Working with Internet Open Trading Protocol](#sec-4)

General Purpose Payment Bridge

# Preface<a id="sec-1" name="sec-1"></a>

## Keyword Conventions<a id="sec-1-1" name="sec-1-1"></a>

The key words &ldquo;MUST&rdquo;, &ldquo;MUST NOT&rdquo;, &ldquo;REQUIRED&rdquo;, &ldquo;SHALL&rdquo;, &ldquo;SHALL NOT&rdquo;, &ldquo;SHOULD&rdquo;,&ldquo;SHOULD NOT&rdquo;, &ldquo;RECOMMENDED&rdquo;, &ldquo;MAY&rdquo;, and &ldquo;OPTIONAL&rdquo; in this document are to beinterpreted as described in [RFC 2119](http://tools.ietf.org/html/rfc2119).

## Typographic Conventions<a id="sec-1-2" name="sec-1-2"></a>

In this document, we use the following typographic conventions:

-   *Italic*

Used for URLs, command names, MIME types, new terms where they are defined, andemphasis

-   `Constant width`

Used for computer output, functions, code, and any literal text

# Overview<a id="sec-2" name="sec-2"></a>

## Defining A Payment Process<a id="sec-2-1" name="sec-2-1"></a>

### PrePay Ticket<a id="sec-2-1-1" name="sec-2-1-1"></a>

1.  Verified Ticket

2.  Payed Ticket

# Payment Strategies<a id="sec-3" name="sec-3"></a>

## Strategy Requirements<a id="sec-3-1" name="sec-3-1"></a>

## Initializing a Strategy (Using Ping++ As Example)<a id="sec-3-2" name="sec-3-2"></a>

# Working with Internet Open Trading Protocol<a id="sec-4" name="sec-4"></a>
